'''
3. Напишіть програму, яка зчитує з клавіатури додаткі числа, які вводить користувач, 
записує їх до масиву та по завершенні вводу виводить середнє значення елементів цього масиву.
Передбачте можливість уведення користувачем некоректних даних. У такому випадку слід вивести 
відповідне повідомлення та повторити ввід.

'''

s = []
while (True):
     try:
        n = int(input("Уведіть ціле додатнє число, або нуль для завершення: "))
        if n == 0:
            break
        else:
            if n < 0:
                print("Недопустиме число")
            else:
                s.append(n)
     except ValueError:
         print("Недопустимий символ чи символи")
sum = 0
for x in s:
    sum += x 
print(sum/len(s))
