'''
1. В аптеку надійшли ліки: валідол за ціною 5 грн, креон — 123 грн,
уніклофен — 96 грн, корвалол — 12 грн, омез — 66 грн.
2. Розробіть програму створення відповідного словника.
За назвою ліків, яку вводить провізор, на екрані повинна висвітлюватися її
назва та місце збереження (холодильник, шухляда, полиця).
У разі відсутності введених ліків повинно висвітлюватися відповідне
повідомлення.
'''
medicine = {'валідол':
                {
                    'price': 5,
                    'place': 'шухляда №1'
                },
            'креон':
                {
                    'price': 5,
                    'place': 'шухляда №2'
                },
            'уніклофен':
                {
                    'price': 96,
                    'place': 'шухляда №3'
                },
            'корвалол':
                {
                    'price': 12,
                    'place': 'холодильник №2'
                },
            'омез':
                {
                    'price': 66,
                    'place': 'холодильник №2'
                },
            }

m = input("Уведіть назву ліків ")

if m in medicine:
    print("Ціна: ", medicine[m]['price'], " грн")
    print("Місце збереження: ", medicine[m]['place'])
else:
    print("Такі ліки відсутні")
